package cn.wonhigh.retail.fas.common.enums;

/**
 * FAS单据类型
 * @author user
 *
 */
public enum FasBillCodeEnums {
	
	FG13010001("FG13010001","到货单-订货(供应商至总部)"),
	FG13010002("FG13010002","到货单-订货(总部至地区)"),
	FG13010003("FG13010003","到货单-订货(总部至地区)"),
	FG13010004("FG13010004","到货单-订货(供应商至地区)"),
	FG13010101("FG13010101","到货单-补货(供应商至总部)"),
	FG13010102("FG13010102","到货单-补货(总部至地区)"),
	FG13010103("FG13010103","到货单-补货(总部至地区)"),
	FG13010104("FG13010104","到货单-补货(供应商至地区)"),
	FG13010201("FG13010201","到货单-直接(供应商至总部)"),
	FG13010202("FG13010202","到货单-直接(供应商至地区)"),
	FG13013301("FG13013301","到货单-收购(供应商至总部)"),
	FG13013302("FG13013302","到货单-收购(供应商至地区)"),
	FG13040001("FG13040001","验收单-订货(总部至地区)"),
	FG13040002("FG13040002","验收单-订货(供应商至地区)"),
	FG13040101("FG13040101","验收单-补货(总部至地区)"),
	FG13040102("FG13040102","验收单-补货(供应商至地区)"),
	FG13040201("FG13040201","验收单-直接(供应商至地区)"),
	FG13041201("FG13041201","验收单-直接差异(供应商至地区)"),
	FG13043301("FG13043301","验收单-收购(供应商至地区)"),
	FG13043401("FG13043401","验收单-收购差异(供应商至地区)"),
	FG13330001("FG13330001","原残退厂发货单(供应商至总部)"),
	FG13330002("FG13330002","原残退厂发货单(总部至地区)"),
	FG13330003("FG13330003","原残退厂发货单(总部至地区)"),
	FG13330004("FG13330004","原残退厂发货单(供应商至地区)"),
	FG13350201("FG13350201","客残销售出库单-地区承担"),
	FG13350301("FG13350301","客残销售出库单-总部承担"),
	FG13351301("FG13351301","领用出库单-物料"),
	FG13352101("FG13352101","批发出库单-销售"),
	FG13352201("FG13352201","批发出库单-过季退货"),
	FG13352301("FG13352301","团购出库单-销售"),
	FG13352401("FG13352401","团购出库单-退货"),
	FG13352901("FG13352901","批发出库单-店出"),
	FG13353001("FG13353001","批发出库单-客残退货"),
	FG13420001("FG13420001","报废单"),
	FG13550801("FG13550801","内销单-索赔"),
	FG13551001("FG13551001","内销单-盘差"),
	FG13552601("FG13552601","内销单-客残内销"),
	FG13610701("FG13610701","借用出库单-公司内部借用(地区至总部)"),
	FG13612501("FG13612501","借用出库单-外部公司借用(地区至总部)"),
	FG13710401("FG13710401","调货出库单-正常(总部至地区)"),
	FG13710402("FG13710402","调货出库单-正常(地区至地区)"),
	FG13710403("FG13710403","调货出库单-正常(地区至总部)"),
	FG13710404("FG13710404","调货出库单-正常冲抵(总部至地区)"),
	FG13710405("FG13710405","调货出库单-正常冲抵(地区至总部)"),
	FG13710501("FG13710501","调货出库单-差异(总部至地区)"),
	FG13710502("FG13710502","调货出库单-差异(地区至地区)"),
	FG13710503("FG13710503","调货出库单-差异(地区至总部)"),
	FG13710504("FG13710504","调货出库单-差异冲抵(总部至地区)"),
	FG13710505("FG13710505","调货出库单-差异冲抵(地区至总部)"),
	FG13714001("FG13714001","调货出库单-残次退回(总部至地区)"),
	FG13714101("FG13714101","调货出库单-残次退回差异(总部至地区)"),
	FG13720401("FG13720401","调货入库单-正常(总部至地区)"),
	FG13720402("FG13720402","调货入库单-正常(地区至地区)"),
	FG13720403("FG13720403","调货入库单-正常(地区至总部)"),
	FG13720404("FG13720404","调货入库单-正常冲抵(总部至地区)"),
	FG13720405("FG13720405","调货入库单-正常冲抵(地区至总部)"),
	FG13720501("FG13720501","调货入库单-差异(总部至地区)"),
	FG13720502("FG13720502","调货入库单-差异(地区至地区)"),
	FG13720503("FG13720503","调货入库单-差异(地区至总部)"),
	FG13720504("FG13720504","调货入库单-差异冲抵(总部至地区)"),
	FG13720505("FG13720505","调货入库单-差异冲抵(地区至总部)"),
	FG13724001("FG13724001","调货入库单-残次退回(总部至地区)"),
	FG13724101("FG13724101","调货入库单-残次差异(总部至地区)"),
	FG20053501("FG20053501","地区客残销售-出库单(地区至总部)"),
	FG20063601("FG20063601","总部客残销售-出库单(总部至地区)"),
	FG20063602("FG20063602","总部客残销售-入库单(总部至地区)"),
	FP10010000("FP10010000","门店销售单(正常销售)"),
	FP10010001("FP10010001","门店销售单(跨店销售)"),
	FP10010002("FP10010002","门店销售单(商场团购)"),
	FP10010003("FP10010003","门店销售单(内购)"),
	FP10010006("FP10010006","门店销售单(特卖销售)"),
	FP10020100("FP10020100","门店退换货单-换货(正常销售)"),
	FP10020101("FP10020101","门店退换货单-换货(跨店销售)"),
	FP10020102("FP10020102","门店退换货单-换货(商场团购)"),
	FP10020103("FP10020103","门店退换货单-换货(内购)"),
	FP10020106("FP10020106","门店退换货单-换货(特卖销售)"),
	FP10020200("FP10020200","门店退换货单-退货(正常销售)"),
	FP10020201("FP10020201","门店退换货单-退货(跨店销售)"),
	FP10020202("FP10020202","门店退换货单-退货(商场团购)"),
	FP10020203("FP10020203","门店退换货单-退货(内购)"),
	FP10020206("FP10020206","门店退换货单-退货(特卖销售)");
	
	private String code;
	
	private String name;

	private FasBillCodeEnums(String code) {
		this.code = code;
	}

	private FasBillCodeEnums(String code, String name) {
		this.code = code;
		this.name = name;
	}

	public String getCode() {
		return code;
	}

	public String getName() {
		return name;
	}

	public static String getNameByCode(String code){
		for (FasBillCodeEnums item : FasBillCodeEnums.values()) {
			if(code.equals(item.getCode())){
				return item.getName();
			}
		}
		return "未知单据类型";
	}
}
